#include <iostream>
using namespace std;
int main()
{int a1,b1,a2,b2,a3,b3;//Променливи за входните данни
 int S,b,ra1,rb1,ra2,rb2,n;//Помощни променливи за намиране на типа разрязване
//Променливи за извеждането на резултата
 int h,w;//размери на големия правоъгълник
 int x1,x2;//позиции на вътрешните вертикали
 int y;//позиция на вътрешната хоризонтала
 
//Вход на данните
 cin>>a1>>b1;
 S=a1*b1;//Лице на въведената правоъгълна част
 cin>>a2>>b2;
 S=S+a2*b2;//Добавяне на новото лице
 cin>>a3>>b3;
 S=S+a3*b3;//Сега в S е лицето на големия правоъгълник
  
//Определяне на типа разрязване и параметрите за изхода
 n=0;//n (от 0 до 5) определя страната, която опитваме за делител на S 
 do
 {switch(n)
  {case 0:{h=a1;b=b1;//отрязваме a1 x b1
           //определяне на оставащите части
           ra1=a2;rb1=b2;ra2=a3;rb2=b3;
           break;}
   case 1:{h=b1;b=a1;//отрязваме b1 x a1
           //определяне на оставащите части
           ra1=a2;rb1=b2;ra2=a3;rb2=b3;
           break;}
   case 2:{h=a2;b=b2;//отрязваме a2 x b2
           ra1=a1;rb1=b1;ra2=a3;rb2=b3;
           break;
          }
   case 3:{h=b2;b=a2;//отрязваме b2 x a2
           ra1=a1;rb1=b1;ra2=a3;rb2=b3;
           break;
          }
   case 4:{h=a3;b=b3;//отрязваме a3 x b3
           ra1=a1;rb1=b1;ra2=a2;rb2=b2;
           break;
          }
   case 5:{h=b3;b=a3;//отрязваме b3 x a3
           ra1=a1;rb1=b1;ra2=a2;rb2=b2;           
          }
  }
  if (S%h==0) //ако избраната страна е делител на S:
  {w=S/h;//определяме ширината.
   //Проверка за разрязване от първи тип
   y=-1;//Няма да има вътрешна хоризонтала
   if (ra1==h && ra2==h){x1=rb1;x2=rb1+rb2;break;}   
   if (ra1==h && rb2==h){x1=rb1;x2=rb1+ra2;break;}   
   if (rb1==h && ra2==h){x1=ra1;x2=ra1+rb2;break;}   
   if (rb1==h && rb2==h){x1=ra1;x2=ra1+ra2;break;}   
   //Проверка за разрязване от втори тип
   x1=w-b;x2=-1;//Има една вътрешна вертикала
   if (ra1==x1 && ra2==x1 && rb1+rb2==h){y=rb1;break;}
   if (ra1==x1 && rb2==x1 && rb1+ra2==h){y=rb1;break;}
   if (rb1==x1 && ra2==x1 && ra1+rb2==h){y=ra1;break;}
   if (rb1==x1 && rb2==x1 && ra1+ra2==h){y=ra1;break;}
  }
  n++;    
 }while (n<6);
 if (n>=6) return 0;//Некоректни входни данни - не трябва да се случва!
//Извеждане на фигурата: правоъгълник с широчина w, височина h,
//с вътрешни вертикални линии на x1 и, евентулано, x2,
//с евентуална вътрешна хоризонтална линия на y (от началото до x1)
 for (int i=0;i<=h;i++)
 {for (int j=0;j<=w;j++)
  //условия, при които на място (i, j) трябва да се изведе точка:
   if (i==0 || i==h || j==0 || j==w || //ако е от контурна линия,
       j==x1 ||                        //ако е от първа вертикала,
       j==x2 ||                        //ако е от втора вертикала,
       (i==y && j<=x1) ||              //ако е от хоризонтала.
       (i<=y && j==x1)) {cout<<'.'; //Извежда се точката,
                         if (j<w) cout<<' ';//ако не е последната за реда - извежда се и интервал след нея.
                        }
   else cout<<"  " ;//Иначе на позиция (i, j) се извеждат два интервала
  cout<<endl; //край на реда.
 }
 return 0;
}